Catalogs/НоменклатураУчетнойСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>НоменклатураУчетнойСистемы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидНоменклатурыУчетнойСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмеренияУчетнойСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment> Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СоответствиеПродукцииНоменклатуреУчетнойСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеПродукцииНоменклатуреУчетнойСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьНоменклатураУчетнойСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураУчетнойСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураУчетнойСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураУчетнойСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НоменклатураУчетнойСистемы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Возвращает список номенклатуры учетной системы по продукции
//
// Параметры:
//  Данные	 - СправочникСсылка	 - ссылка на справочник типа:
//  	СправочникСсылка.СвойстваЗаписейСкладскогоЖурнала, СправочникСсылка.Продукция.
//  Текст	 - Строка			 - значение автоподбора.
// 
// Возвращаемое значение:
//  СписокЗначений - список объектов справочника "Номенклатура учетной системы".
//
Функция НоменклатураУчетнойСистемыПоПродукции(Данные, Текст = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоответствиеПродукцииНоменклатуреУчетнойСистемы.НоменклатураУчетнойСистемы КАК НоменклатураУчетнойСистемы
		|ИЗ
		|	РегистрСведений.СоответствиеПродукцииНоменклатуреУчетнойСистемы КАК СоответствиеПродукцииНоменклатуреУчетнойСистемы
		|ГДЕ
		|	СоответствиеПродукцииНоменклатуреУчетнойСистемы.Продукция = &Продукция
		|	И НЕ СоответствиеПродукцииНоменклатуреУчетнойСистемы.НоменклатураУчетнойСистемы.ПометкаУдаления";
	
	Если ТипЗнч(Данные) = Тип("СправочникСсылка.СвойстваЗаписейСкладскогоЖурнала") Тогда
		
		Запрос.УстановитьПараметр("Продукция", Данные.Продукция);
		
	Иначе
		
		Запрос.УстановитьПараметр("Продукция", Данные);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		Запрос.Текст = Запрос.Текст + "
			|	И СоответствиеПродукцииНоменклатуреУчетнойСистемы.НоменклатураУчетнойСистемы.Наименование ПОДОБНО &Текст";
		
		Запрос.УстановитьПараметр("Текст", "%" + Текст + "%");
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокЗначений = Новый СписокЗначений;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.НоменклатураУчетнойСистемы);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

// Возвращает список номенклатуры учетной системы по продукции
//
// Параметры:
//  Данные	 - СправочникСсылка	 - ссылка на справочник типа:
//  	СправочникСсылка.СвойстваЗаписейСкладскогоЖурнала, СправочникСсылка.Продукция.
// 
// Возвращаемое значение:
//  СписокЗначений - список объектов справочника "Номенклатура учетной системы".
//
Функция ПолучитьНоменклатуруУчетнойСитсемы(Данные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СоответствиеПродукцииНоменклатуреУчетнойСистемы.НоменклатураУчетнойСистемы КАК НоменклатураУчетнойСистемы
		|ИЗ
		|	РегистрСведений.СоответствиеПродукцииНоменклатуреУчетнойСистемы КАК СоответствиеПродукцииНоменклатуреУчетнойСистемы
		|ГДЕ
		|	СоответствиеПродукцииНоменклатуреУчетнойСистемы.Продукция = &Продукция
		|	И НЕ СоответствиеПродукцииНоменклатуреУчетнойСистемы.НоменклатураУчетнойСистемы.ПометкаУдаления";
	
	Если ТипЗнч(Данные) = Тип("СправочникСсылка.СвойстваЗаписейСкладскогоЖурнала") Тогда
		
		Запрос.УстановитьПараметр("Продукция", Данные.Продукция);
		
	Иначе
		
		Запрос.УстановитьПараметр("Продукция", Данные);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Справочники.НоменклатураУчетнойСистемы.ПустаяСсылка();
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.НоменклатураУчетнойСистемы;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
